app/controllers/translations_controller.rb

SELECT "translations".* FROM "translations"
---
  def index
    @translations = Translation.all

INSERT INTO "translations" ("created_at", "punjabi", "updated_at", "urdu") VALUES (?, ?, ?, ?)  [["created_at", Mon, 11 Jul 2016 05:16:30 UTC +00:00], ["punjabi", "Roop"], ["updated_at", Mon, 11 Jul 2016 05:16:30 UTC +00:00], ["urdu", ""]]
---
  def create
    @translation = Translation.new(translation_params)

    respond_to do |format|
      if @translation.save

UPDATE "translations" SET "punjabi" = ?, "urdu" = ?, "updated_at" = ? WHERE "translations"."id" = 1  [["punjabi", "Arsh"], ["urdu", "Deep"], ["updated_at", Mon, 11 Jul 2016 05:18:54 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @translation.update(translation_params)

DELETE FROM "translations" WHERE "translations"."id" = ?  [["id", 2]]
---
  def destroy
    @translation.destroy

SELECT "translations".* FROM "translations" WHERE "translations"."id" = ? LIMIT 1  [["id", "_form"]]
---
    def set_translation
      @translation = Translation.find(params[:id])